Repository: Linus-Shyu/Luma-Bar
Catalog: Sources/LumaBar/Resources/Localizable.xcstrings
Source language: en
Languages: de, es, fr, it, ja, ko, pt_br, ru, zh_hans, zh_hant

# scan.scanning_all
source: Scanning local and NetEase music
de: Lokal und NetEase werden gescannt
es: Analizando local y NetEase
fr: Analyse locale et NetEase
it: Scansione locale e NetEase
ja: ローカルと NetEase をスキャン中
ko: 로컬 및 NetEase 스캔 중
pt_br: Analisando local e NetEase
ru: Сканирование локально и NetEase
zh_hans: 正在扫描本地与网易云音乐
zh_hant: 正在掃描本機與網易雲音樂

# scan.grant_folder
source: Grant a music folder to scan local tracks
de: Musikordner freigeben, um lokale Titel zu scannen
es: Autoriza una carpeta de música para escanear pistas locales
fr: Autorisez un dossier musique pour scanner les titres locaux
it: Autorizza una cartella musica per scansionare i brani locali
ja: ローカル曲をスキャンするには音楽フォルダを許可してください
ko: 로컬 트랙을 스캔하려면 음악 폴더를 허용하세요
pt_br: Autorize uma pasta de música para analisar faixas locais
ru: Разрешите папку с музыкой для сканирования локальных треков
zh_hans: 请授权音乐文件夹以扫描本地曲目
zh_hant: 請授權音樂資料夾以掃描本機曲目

# scan.none
source: No music found
de: Keine Musik gefunden
es: No se encontró música
fr: Aucune musique trouvée
it: Nessuna musica trovata
ja: 音楽が見つかりません
ko: 음악을 찾을 수 없음
pt_br: Nenhuma música encontrada
ru: Музыка не найдена
zh_hans: 未找到音乐
zh_hant: 找不到音樂

# scan.found_format
source: %d tracks found
de: %d Titel gefunden
es: %d pistas encontradas
fr: %d titres trouvés
it: %d brani trovati
ja: %d 曲見つかりました
ko: %d곡 발견
pt_br: %d faixas encontradas
ru: Найдено треков: %d
zh_hans: 已找到 %d 首
zh_hant: 已找到 %d 首

# agent.ready
source: Ready
de: Bereit
es: Listo
fr: Prêt
it: Pronto
ja: 準備完了
ko: 준비됨
pt_br: Pronto
ru: Готово
zh_hans: 就绪
zh_hant: 就緒

# agent.ready_detail
source: Ready.
de: Bereit.
es: Listo.
fr: Prêt.
it: Pronto.
ja: 準備完了。
ko: 준비됨.
pt_br: Pronto.
ru: Готово.
zh_hans: 就绪。
zh_hant: 就緒。

# island.quick.explain
source: Explain
de: Erklären
es: Explicar
fr: Expliquer
it: Spiega
ja: 解説
ko: 설명
pt_br: Explicar
ru: Объяснить
zh_hans: 解释
zh_hant: 解釋

# island.quick.comment
source: Comment
de: Kommentieren
es: Comentar
fr: Commenter
it: Commenta
ja: コメント
ko: 주석
pt_br: Comentar
ru: Комментарий
zh_hans: 注释
zh_hant: 註解

# island.quick.professional
source: Professional
de: Professionell
es: Profesional
fr: Pro
it: Professionale
ja: ビジネス向け
ko: 전문
pt_br: Profissional
ru: Деловой
zh_hans: 专业润色
zh_hant: 專業潤色

# island.quick.simplify
source: Simplify
de: Vereinfachen
es: Simplificar
fr: Simplifier
it: Semplifica
ja: 簡潔化
ko: 간단히
pt_br: Simplificar
ru: Упростить
zh_hans: 简化
zh_hant: 簡化

# island.quick.proofread
source: Proofread
de: Korrektur
es: Revisar
fr: Relire
it: Correggi
ja: 校正
ko: 교정
pt_br: Revisar
ru: Вычитка
zh_hans: 校对
zh_hant: 校對

# island.quick.outline
source: Outline
de: Gliederung
es: Esquema
fr: Plan
it: Schema
ja: 構成
ko: 개요
pt_br: Roteiro
ru: План
zh_hans: 提纲
zh_hant: 大綱

# island.quick.tldr
source: TL;DR
de: Kurzfassung
es: Resumen
fr: Résumé
it: Riassunto
ja: 要約
ko: 요약
pt_br: Resumo
ru: Кратко
zh_hans: 摘要
zh_hant: 摘要

# island.quick.key_points
source: Key Points
de: Kernpunkte
es: Claves
fr: Points clés
it: Punti chiave
ja: 要点
ko: 핵심
pt_br: Pontos-chave
ru: Ключевые
zh_hans: 要点
zh_hant: 要點

# island.quick.next
source: Next
de: Weiter
es: Siguiente
fr: Suivant
it: Avanti
ja: 次へ
ko: 다음
pt_br: Próxima
ru: Далее
zh_hans: 下一首
zh_hant: 下一首

# island.quick.mood
source: Mood
de: Stimmung
es: Ambiente
fr: Ambiance
ja: ムード
ko: 분위기
pt_br: Clima
ru: Настроение
zh_hans: 氛围
zh_hant: 氛圍

# island.sys.memory
source: Memory
de: Speicher
es: Memoria
fr: Mémoire
it: Memoria
ja: メモリ
ko: 메모리
pt_br: Memória
ru: Память
zh_hans: 内存
zh_hant: 記憶體

# island.sys.disk
source: Disk
de: Festplatte
es: Disco
fr: Disque
it: Disco
ja: ディスク
ko: 디스크
pt_br: Disco
ru: Диск
zh_hans: 磁盘
zh_hant: 磁碟

# island.sys.battery
source: Battery
de: Akku
es: Batería
fr: Batterie
it: Batteria
ja: バッテリー
ko: 배터리
pt_br: Bateria
ru: Батарея
zh_hans: 电池
zh_hant: 電池

# island.sys.uptime
source: Uptime
de: Laufzeit
es: Actividad
ja: 稼働時間
ko: 가동 시간
pt_br: Tempo ativo
ru: Аптайм
zh_hans: 运行时间
zh_hant: 運作時間

# island.sys.total_format
source: Total %@
de: Gesamt %@
it: Totale %@
ja: 合計 %@
ko: 합계 %@
ru: Всего %@
zh_hans: 合计 %@
zh_hant: 合計 %@

# island.action.rescan
source: Rescan Music
de: Musik neu scannen
es: Reescanear música
fr: Rescanner la musique
it: Nuova scansione musica
ja: 音楽を再スキャン
ko: 음악 다시 스캔
pt_br: Verificar música de novo
ru: Пересканировать музыку
zh_hans: 重新扫描音乐
zh_hant: 重新掃描音樂

# island.action.open_netease
source: Open NetEase Cloud Music
de: NetEase öffnen
es: Abrir NetEase
fr: Ouvrir NetEase
it: Apri NetEase
ja: NetEaseを開く
ko: NetEase 열기
pt_br: Abrir NetEase
ru: Открыть NetEase
zh_hans: 打开网易云音乐
zh_hant: 打開網易雲音樂

# island.action.open_apple_music
source: Open Apple Music
de: Apple Music öffnen
es: Abrir Apple Music
fr: Ouvrir Apple Music
it: Apri Apple Music
ja: Apple Musicを開く
ko: Apple Music 열기
pt_br: Abrir Apple Music
ru: Открыть Apple Music
zh_hans: 打开 Apple Music
zh_hant: 打开 Apple Music

# island.action.refresh_playlists
source: Refresh NetEase Playlists
de: Playlists aktualisieren
es: Actualizar playlists
fr: Actualiser les playlists
it: Aggiorna playlist
ja: プレイリスト更新
ko: 재생목록 새로고침
pt_br: Atualizar playlists
ru: Обновить плейлисты
zh_hans: 刷新网易云歌单
zh_hant: 重新整理網易雲歌單

# island.action.switch_music
source: Switch to Music
de: Zu Musik
es: Ir a Música
fr: Passer en Musique
it: Vai a Musica
ja: ミュージックへ
ko: 음악으로
pt_br: Ir para Música
ru: К музыке
zh_hans: 切换到音乐
zh_hant: 切換到音樂

# island.action.switch_system
source: Switch to System
de: Zu System
es: Ir a Sistema
fr: Passer en Système
it: Vai a Sistema
ja: システムへ
ko: 시스템으로
pt_br: Ir para Sistema
ru: К системе
zh_hans: 切换到系统
zh_hant: 切換到系統

# island.action.switch_agent
source: Switch to Agent
de: Zu Agent
es: Ir a Agent
fr: Passer en Agent
it: Vai ad Agent
ja: Agentへ
ko: Agent로
pt_br: Ir para Agent
ru: К Agent
zh_hans: 切换到 Agent
zh_hant: 切換到 Agent

# island.action.quit
source: Quit
de: Beenden
es: Salir
fr: Quitter
it: Esci
ja: 終了
ko: 종료
pt_br: Sair
ru: Выйти
zh_hans: 退出
zh_hant: 結束

# island.agent.paste_key
source: Paste API key
de: API-Key einfügen
es: Pegar clave API
fr: Coller la clé API
it: Incolla chiave API
ja: APIキーを貼り付け
ko: API 키 붙여넣기
pt_br: Colar chave API
ru: Вставить API-ключ
zh_hans: 粘贴 API Key
zh_hant: 貼上 API Key

# island.agent.clear_key
source: Clear API key
de: API-Key löschen
es: Borrar clave API
fr: Effacer la clé API
it: Cancella chiave API
ja: APIキーを消去
ko: API 키 지우기
pt_br: Limpar chave API
ru: Очистить API-ключ
zh_hans: 清除 API Key
zh_hant: 清除 API Key

# island.agent.copy_command
source: Copy command
de: Befehl kopieren
es: Copiar comando
fr: Copier la commande
it: Copia comando
ja: コマンドをコピー
ko: 명령 복사
pt_br: Copiar comando
ru: Копировать команду
zh_hans: 复制命令
zh_hant: 拷貝指令

# island.token.input
source: Input
de: Eingabe
es: Entrada
fr: Entrée
ja: 入力
ko: 입력
pt_br: Entrada
ru: Вход
zh_hans: 输入
zh_hant: 輸入

# island.token.output
source: Output
de: Ausgabe
es: Salida
fr: Sortie
ja: 出力
ko: 출력
pt_br: Saída
ru: Выход
zh_hans: 输出
zh_hant: 輸出

# island.token.remaining
source: Remaining
de: Übrig
es: Restante
fr: Restant
it: Rimanente
ja: 残り
ko: 남음
pt_br: Restante
ru: Осталось
zh_hans: 剩余
zh_hant: 剩餘

# island.pet.help
source: Click to talk, long-press for Voice Whisper, drag to move
de: Klicken zum Sprechen, lange drücken für Voice Whisper, ziehen zum Verschieben
es: Clic para hablar, mantén para Voice Whisper, arrastra para mover
fr: Clic pour parler, appui long pour Voice Whisper, glisser pour déplacer
it: Clic per parlare, tieni premuto per Voice Whisper, trascina per spostare
ja: クリックで会話、長押しで Voice Whisper、ドラッグで移動
ko: 클릭해 대화, 길게 눌러 Voice Whisper, 드래그로 이동
pt_br: Clique para falar, mantenha para Voice Whisper, arraste para mover
ru: Клик — говорить, долгое нажатие — Voice Whisper, перетаскивание — переместить
zh_hans: 单击说话，长按 Voice Whisper，拖动可移动
zh_hant: 單擊說話，長按 Voice Whisper，拖曳可移動

# island.pet.talk
source: Talk
de: Sprechen
es: Hablar
fr: Parler
it: Parla
ja: 話す
ko: 말하기
pt_br: Falar
ru: Говорить
zh_hans: 说话
zh_hant: 說話

# island.token.open_help_format
source: Open token usage · %@ tokens
de: Verbrauch öffnen · %@ tokens
es: Abrir uso · %@ tokens
fr: Ouvrir l’usage · %@ tokens
it: Apri utilizzo · %@ tokens
ja: 使用量を開く · %@ tokens
ko: 사용량 열기 · %@ tokens
pt_br: Abrir uso · %@ tokens
ru: Открыть расход · %@ tokens
zh_hans: 打开用量 · %@ tokens
zh_hant: 打開用量 · %@ tokens

# island.agent.placeholder.shell
source: Describe shell task, then press Return
de: Shell-Aufgabe beschreiben, dann Return
es: Describe la tarea shell y pulsa Return
fr: Décrivez la tâche shell, puis Entrée
it: Descrivi il task shell, poi Return
ja: シェル作業を書いて Return
ko: 셸 작업을 적은 뒤 Return
pt_br: Descreva a tarefa shell e pressione Return
ru: Опишите shell-задачу и нажмите Return
zh_hans: 描述要执行的 Shell 任务，然后按回车
zh_hant: 描述要執行的 Shell 任務，然後按 Return

# island.agent.placeholder.code
source: Ask about code or generate a command
de: Code fragen oder Befehl erzeugen
es: Pregunta por código o genera un comando
fr: Questionnez le code ou générez une commande
it: Chiedi sul codice o genera un comando
ja: コードについて聞くかコマンドを生成
ko: 코드에 대해 묻거나 명령 생성
pt_br: Pergunte sobre código ou gere um comando
ru: Спросите о коде или сгенерируйте команду
zh_hans: 询问代码或生成命令
zh_hant: 詢問程式碼或產生命令

# island.agent.placeholder.writing
source: Rewrite, expand, or refine
de: Umschreiben, erweitern oder feilen
es: Reescribe, amplía o refina
fr: Réécrire, développer ou peaufiner
it: Riscrivi, espandi o perfeziona
ja: 書き換え・拡充・推敲
ko: 다시 쓰기, 확장 또는 다듬기
pt_br: Reescreva, amplie ou refine
ru: Переписать, расширить или улучшить
zh_hans: 改写、扩写或润色
zh_hant: 改寫、擴寫或潤色

# island.agent.placeholder.reading
source: Ask about this page or document
de: Diese Seite oder das Dokument fragen
es: Pregunta por esta página o documento
fr: Questionnez cette page ou ce document
it: Chiedi su questa pagina o documento
ja: このページや文書について聞く
ko: 이 페이지나 문서에 대해 묻기
pt_br: Pergunte sobre esta página ou documento
ru: Спросите о странице или документе
zh_hans: 询问当前页面或文档
zh_hant: 詢問目前頁面或文件

# island.agent.placeholder.gaming
source: Ask about a game, item, or build
de: Spiel, Item oder Build fragen
es: Pregunta por juego, objeto o build
fr: Jeux, objets ou builds
it: Chiedi su gioco, oggetto o build
ja: ゲーム・アイテム・ビルドについて
ko: 게임, 아이템, 빌드에 대해
pt_br: Pergunte sobre jogo, item ou build
ru: Спросите об игре, предмете или билде
zh_hans: 询问游戏、道具或出装
zh_hant: 詢問遊戲、道具或出裝

# island.agent.placeholder.music
source: Control music naturally
de: Musik natürlich steuern
es: Controla la música con naturalidad
fr: Contrôlez la musique naturellement
it: Controlla la musica in modo naturale
ja: 自然な言葉で音楽を操作
ko: 자연어로 음악 제어
pt_br: Controle a música naturalmente
ru: Управляйте музыкой естественно
zh_hans: 用自然语言控制音乐
zh_hant: 用自然語言控制音樂

# island.agent.placeholder.general
source: Message
de: Nachricht
es: Mensaje
it: Messaggio
ja: メッセージ
ko: 메시지
pt_br: Mensagem
ru: Сообщение
zh_hans: 输入消息
zh_hant: 輸入訊息

# island.agent.title.writing
source: Writing Agent
de: Schreib-Agent
es: Agent de escritura
fr: Agent Écriture
it: Agent Scrittura
ja: 執筆 Agent
ko: 글쓰기 Agent
pt_br: Agent de escrita
ru: Agent письма
zh_hans: 写作 Agent
zh_hant: 寫作 Agent

# island.agent.title.reading
source: Reading Agent
de: Lese-Agent
es: Agent de lectura
fr: Agent Lecture
it: Agent Lettura
ja: 読書 Agent
ko: 읽기 Agent
pt_br: Agent de leitura
ru: Agent чтения
zh_hans: 阅读 Agent
zh_hant: 閱讀 Agent

# island.agent.title.gaming
source: Game Agent
de: Spiel-Agent
es: Agent de juegos
fr: Agent Jeu
it: Agent Giochi
ja: ゲーム Agent
ko: 게임 Agent
pt_br: Agent de jogos
ru: Agent игр
zh_hans: 游戏 Agent
zh_hant: 遊戲 Agent

# island.agent.title.music
source: Music Agent
de: Musik-Agent
es: Agent de música
fr: Agent Musique
it: Agent Musica
ja: 音楽 Agent
ko: 음악 Agent
pt_br: Agent de música
ru: Agent музыки
zh_hans: 音乐 Agent
zh_hant: 音樂 Agent

# island.agent.open
source: Open agent
de: Agent öffnen
es: Abrir agent
fr: Ouvrir l’agent
it: Apri agent
ja: Agent を開く
ko: Agent 열기
pt_br: Abrir agent
ru: Открыть Agent
zh_hans: 打开 Agent
zh_hant: 打開 Agent

# island.agent.close
source: Close agent
de: Agent schließen
es: Cerrar agent
fr: Fermer l’agent
it: Chiudi agent
ja: Agent を閉じる
ko: Agent 닫기
pt_br: Fechar agent
ru: Закрыть Agent
zh_hans: 关闭 Agent
zh_hant: 關閉 Agent

# island.agent.api_key_needed
source: API key needed
de: API-Key benötigt
es: Se necesita clave API
fr: Clé API requise
it: Serve una chiave API
ja: APIキーが必要
ko: API 키 필요
pt_br: Chave de API necessária
ru: Нужен API-ключ
zh_hans: 需要 API Key
zh_hant: 需要 API Key

# island.agent.thinking
source: Thinking
de: Denkt nach
es: Pensando
fr: Réflexion
it: Elaborazione
ja: 思考中
ko: 생각 중
pt_br: Pensando
ru: Думаю
zh_hans: 思考中
zh_hant: 思考中

# island.agent.canceled
source: Canceled
de: Abgebrochen
es: Cancelado
fr: Annulé
it: Annullato
ja: キャンセル
ko: 취소됨
pt_br: Cancelado
ru: Отменено
zh_hans: 已取消
zh_hant: 已取消

# island.agent.planning
source: Planning local actions
de: Lokale Aktionen planen
es: Planificando acciones locales
fr: Planification d’actions locales
it: Pianificazione azioni locali
ja: ローカル操作を計画中
ko: 로컬 작업 계획 중
pt_br: Planejando ações locais
ru: Планирование локальных действий
zh_hans: 正在规划本地动作
zh_hant: 正在規劃本機動作

# island.agent.planning_failed
source: Planning failed
de: Planung fehlgeschlagen
es: Planificación fallida
fr: Échec de la planification
it: Pianificazione non riuscita
ja: 計画に失敗
ko: 계획 실패
pt_br: Falha no planejamento
ru: Ошибка планирования
zh_hans: 规划失败
zh_hant: 規劃失敗

# island.agent.confirm_send
source: Confirm send
de: Senden bestätigen
es: Confirmar envío
fr: Confirmer l’envoi
it: Conferma invio
ja: 送信を確認
ko: 전송 확인
pt_br: Confirmar envio
ru: Подтвердить отправку
zh_hans: 确认发送
zh_hant: 確認傳送

# island.agent.confirm_send_again
source: Tap again to confirm send
de: Erneut tippen zum Bestätigen
es: Toca de nuevo para confirmar
fr: Appuyez encore pour confirmer
it: Tocca di nuovo per confermare
ja: もう一度タップして送信確認
ko: 다시 눌러 전송 확인
pt_br: Toque de novo para confirmar
ru: Нажмите ещё раз для подтверждения
zh_hans: 再次点击确认发送
zh_hant: 再次點一下確認傳送

# island.agent.sending
source: Sending
de: Senden…
es: Enviando
fr: Envoi…
it: Invio…
ja: 送信中
ko: 전송 중
pt_br: Enviando
ru: Отправка…
zh_hans: 正在发送
zh_hant: 正在傳送

# island.agent.sent
source: Sent
de: Gesendet
es: Enviado
fr: Envoyé
it: Inviato
ja: 送信済み
ko: 전송됨
pt_br: Enviado
ru: Отправлено
zh_hans: 已发送
zh_hant: 已傳送

# island.agent.send_failed
source: Send failed
de: Senden fehlgeschlagen
es: Error al enviar
fr: Échec de l’envoi
it: Invio non riuscito
ja: 送信失敗
ko: 전송 실패
pt_br: Falha ao enviar
ru: Ошибка отправки
zh_hans: 发送失败
zh_hant: 傳送失敗

# island.music.play
source: Play
de: Wiedergeben
es: Reproducir
fr: Lecture
it: Riproduci
ja: 再生
ko: 재생
pt_br: Reproduzir
ru: Играть
zh_hans: 播放
zh_hant: 播放

# island.music.open_player
source: Open player
de: Player öffnen
es: Abrir reproductor
fr: Ouvrir le lecteur
it: Apri player
ja: プレーヤーを開く
ko: 플레이어 열기
pt_br: Abrir player
ru: Открыть плеер
zh_hans: 打开播放器
zh_hant: 打開播放器

# island.lyrics.no_track
source: No track selected
de: Kein Titel gewählt
es: Ninguna pista
fr: Aucun morceau
it: Nessun brano
ja: 曲未選択
ko: 선택된 트랙 없음
pt_br: Nenhuma faixa
ru: Трек не выбран
zh_hans: 未选择曲目
zh_hant: 未選擇曲目

# island.lyrics.none
source: No lyrics
de: Keine Lyrics
es: Sin letras
fr: Pas de paroles
it: Nessun testo
ja: 歌詞なし
ko: 가사 없음
pt_br: Sem letras
ru: Нет текста
zh_hans: 暂无歌词
zh_hant: 暫無歌詞

# island.lyrics.loading
source: Loading lyrics…
de: Lyrics werden geladen…
es: Cargando letras…
fr: Chargement des paroles…
it: Caricamento testi…
ja: 歌詞を読み込み中…
ko: 가사 불러오는 중…
pt_br: Carregando letras…
ru: Загрузка текста…
zh_hans: 正在加载歌词…
zh_hant: 正在載入歌詞…

# island.lyrics.no_embedded
source: No embedded lyrics
de: Keine eingebetteten Lyrics
es: Sin letras incrustadas
fr: Pas de paroles intégrées
it: Nessun testo incorporato
ja: 埋め込み歌詞なし
ko: 내장 가사 없음
pt_br: Sem letras incorporadas
ru: Нет встроенного текста
zh_hans: 无内嵌歌词
zh_hant: 無內嵌歌詞

# island.library.local_subtitle
source: Local library
de: Lokale Mediathek
es: Biblioteca local
fr: Bibliothèque locale
it: Libreria locale
ja: ローカルライブラリ
ko: 로컬 라이브러리
pt_br: Biblioteca local
ru: Локальная библиотека
zh_hans: 本地曲库
zh_hant: 本機曲庫

# island.companion.title
source: Desktop Companion
de: Desktop-Begleiter
es: Compañero de escritorio
fr: Compagnon de bureau
it: Compagno desktop
ja: デスクトップコンパニオン
ko: 데스크톱 컴패니언
pt_br: Companheiro de desktop
ru: Настольный компаньон
zh_hans: 桌面伴侣
zh_hant: 桌面伴侶

# island.companion.subtitle
source: Desktop companion
de: Desktop-Begleiter
es: Compañero de escritorio
fr: Compagnon de bureau
it: Compagno desktop
ja: デスクトップコンパニオン
ko: 데스크톱 컴패니언
pt_br: Companheiro de desktop
ru: Настольный компаньон
zh_hans: 桌面伴侣
zh_hant: 桌面伴侶

# island.apple_music.playing
source: Playing via Apple Music (Music.app)
de: Wiedergabe über Apple Music (Music.app)
es: Reproduciendo vía Apple Music (Music.app)
fr: Lecture via Apple Music (Music.app)
it: In riproduzione tramite Apple Music (Music.app)
ja: Apple Music（Music.app）で再生中
ko: Apple Music(Music.app)으로 재생 중
pt_br: Reproduzindo via Apple Music (Music.app)
ru: Воспроизведение через Apple Music (Music.app)
zh_hans: 正在通过 Apple Music（Music.app）播放
zh_hant: 正在透過 Apple Music（Music.app）播放

# island.apple_music.empty
source: Play a song in Music.app to see it here
de: Spielen Sie einen Titel in Music.app ab, damit er hier erscheint
es: Reproduce una canción en Music.app para verla aquí
fr: Lancez une chanson dans Music.app pour l’afficher ici
it: Riproduci un brano in Music.app per vederlo qui
ja: Music.app で曲を再生するとここに表示されます
ko: Music.app에서 곡을 재생하면 여기에 표시됩니다
pt_br: Reproduza uma música no Music.app para vê-la aqui
ru: Воспроизведите трек в Music.app, чтобы увидеть его здесь
zh_hans: 在 Music.app 中播放歌曲后，将显示在这里
zh_hant: 在 Music.app 中播放歌曲後，將顯示在這裡

# island.library.local_file
source: Local file
de: Lokale Datei
es: Archivo local
fr: Fichier local
it: File locale
ja: ローカルファイル
ko: 로컬 파일
pt_br: Arquivo local
ru: Локальный файл
zh_hans: 本地文件
zh_hant: 本機檔案

# agent.configure_key_format
source: Configure a %@ API key, or inject a built-in key.
de: Konfigurieren Sie einen %@-API-Key oder injizieren Sie einen eingebauten Key.
es: Configura una clave API de %@ o inyecta una clave integrada.
fr: Configurez une clé API %@, ou injectez une clé intégrée.
it: Configura una chiave API %@ oppure inserisci una chiave integrata.
ja: %@ の APIキーを設定するか、内蔵キーを注入してください。
ko: %@ API 키를 설정하거나 내장 키를 주입하세요.
pt_br: Configure uma chave de API %@ ou injete uma chave integrada.
ru: Настройте API-ключ %@ или внедрите встроенный ключ.
zh_hans: 请配置 %@ API Key，或注入内置密钥。
zh_hant: 請設定 %@ API Key，或注入內建金鑰。

# agent.configure_key_first_format
source: Configure a %@ API key first, or inject a built-in key at build time.
de: Konfigurieren Sie zuerst einen %@-API-Key oder injizieren Sie beim Build einen eingebauten Key.
es: Configura primero una clave API de %@ o inyecta una clave integrada al compilar.
fr: Configurez d’abord une clé API %@, ou injectez une clé intégrée à la compilation.
it: Configura prima una chiave API %@ oppure inserisci una chiave integrata in build.
ja: 先に %@ の APIキーを設定するか、ビルド時に内蔵キーを注入してください。
ko: 먼저 %@ API 키를 설정하거나 빌드 시 내장 키를 주입하세요.
pt_br: Configure primeiro uma chave de API %@ ou injete uma chave integrada na compilação.
ru: Сначала настройте API-ключ %@ или внедрите встроенный ключ при сборке.
zh_hans: 请先配置 %@ API Key，或在构建时注入内置密钥。
zh_hant: 請先設定 %@ API Key，或在建置時注入內建金鑰。

# menu.theme.aura_opacity
source: Opacity
de: Deckkraft
es: Opacidad
fr: Opacité
it: Opacità
ja: 不透明度
ko: 불투명도
pt_br: Opacidade
ru: Прозрачность
zh_hans: 透明度
zh_hant: 透明度

# about.version_format
source: Version %@ (%@)\ \ %@
es: Versión %@ (%@)\ \ %@
it: Versione %@ (%@)\ \ %@
ja: バージョン %@（%@）\ \ %@
ko: 버전 %@ (%@)\ \ %@
pt_br: Versão %@ (%@)\ \ %@
ru: Версия %@ (%@)\ \ %@
zh_hans: 版本 %@（%@）\ \ %@
zh_hant: 版本 %@（%@）\ \ %@

# island.mode.system
source: System
es: Sistema
fr: Système
it: Sistema
ja: システム
ko: 시스템
pt_br: Sistema
ru: Система
zh_hans: 系统
zh_hant: 系統

# permission.badge.optional
source: Optional
es: Opcional
fr: Optionnel
it: Opzionale
ja: 任意
ko: 선택
pt_br: Opcional
ru: Дополнительно
zh_hans: 可选
zh_hant: 選用

# permission.automation.title
source: Automation
es: Automatización
fr: Automatisation
it: Automazione
ja: オートメーション
ko: 자동화
pt_br: Automação
ru: Автоматизация
zh_hans: 自动化控制
zh_hant: 自動化控制

# island.quick.refactor
source: Refactor
es: Refactorizar
fr: Refactoriser
ja: リファクタ
ko: 리팩터
pt_br: Refatorar
ru: Рефактор
zh_hans: 重构
zh_hant: 重構

# island.quick.guide
source: Guide
es: Guía
it: Guida
ja: ガイド
ko: 가이드
pt_br: Guia
ru: Гайд
zh_hans: 攻略
zh_hant: 攻略

# island.quick.screen
source: Screen
es: Pantalla
fr: Écran
it: Schermo
ja: 画面
ko: 화면
pt_br: Tela
ru: Экран
zh_hans: 截图
zh_hant: 截圖

# island.agent.tools
source: TOOLS
es: HERRAMIENTAS
fr: OUTILS
it: STRUMENTI
ja: ツール
ko: 도구
pt_br: FERRAMENTAS
ru: ИНСТРУМЕНТЫ
zh_hans: 工具
zh_hant: 工具

# island.agent.title.code
source: Code Agent
es: Agent de código
fr: Agent Code
it: Agent Codice
ja: コード Agent
ko: 코드 Agent
pt_br: Agent de código
ru: Agent кода
zh_hans: 代码 Agent
zh_hant: 程式碼 Agent

# island.music.pause
source: Pause
es: Pausa
it: Pausa
ja: 一時停止
ko: 일시 정지
pt_br: Pausar
ru: Пауза
zh_hans: 暂停
zh_hant: 暫停

# island.quick.build
source: Build
ja: ビルド
ko: 빌드
ru: Сборка

# island.agent.context.code
source: Code
ja: コード
zh_hans: 代码
zh_hant: 程式碼

# island.agent.context.writing
source: Writing
ja: 執筆
zh_hans: 写作
zh_hant: 寫作

# island.agent.context.reading
source: Reading
ja: 読書
zh_hans: 阅读
zh_hant: 閱讀

# island.agent.context.gaming
source: Gaming
ja: ゲーム
zh_hans: 游戏
zh_hant: 遊戲

# island.agent.context.music
source: Music
ja: 音楽
zh_hans: 音乐
zh_hant: 音樂

# island.agent.context.general
source: General
ja: 一般
zh_hans: 通用
zh_hant: 通用

# island.agent.streaming_format
source: %@ Streaming
ja: %@ ストリーミング中
zh_hans: %@ 流式输出中
zh_hant: %@ 串流輸出中

# island.agent.voice_input
source: Voice input
ja: 音声入力
zh_hans: 语音输入
zh_hant: 語音輸入

# island.agent.running_command
source: Running command
ja: コマンド実行中
zh_hans: 正在执行命令
zh_hant: 正在執行命令

# island.agent.connecting
source: Connecting
ja: 接続中
zh_hans: 正在连接
zh_hant: 正在連線

# island.agent.writing
source: Writing
ja: 書き込み中
zh_hans: 正在写入
zh_hant: 正在寫入

# island.agent.ask
source: Ask
ja: 質問
zh_hans: 提问
zh_hant: 提問

# island.agent.last_request
source: Last request
ja: 前回のリクエスト
zh_hans: 上次请求
zh_hant: 上次請求

# island.agent.reading_context
source: Reading context
ja: コンテキスト読取中
zh_hans: 正在读取上下文
zh_hant: 正在讀取上下文

# island.agent.current_context
source: Current context
ja: 現在のコンテキスト
zh_hans: 当前上下文
zh_hant: 目前上下文

# island.agent.ai_token_usage
source: AI token usage
ja: AIトークン使用量
zh_hans: AI Token 用量
zh_hant: AI Token 用量

# island.agent.shell_request
source: Shell request
ja: シェル要求
zh_hans: Shell 请求
zh_hant: Shell 請求

# island.agent.key_saved_format
source: %@ key saved
ja: %@ キーを保存しました
zh_hans: %@ 密钥已保存
zh_hant: %@ 金鑰已儲存

# island.agent.key_save_failed
source: Key save failed
ja: キーの保存に失敗
zh_hans: 密钥保存失败
zh_hant: 金鑰儲存失敗

# island.agent.using_builtin_format
source: Using built-in %@
ja: 内蔵 %@ を使用中
zh_hans: 正在使用内置 %@
zh_hant: 正在使用內建 %@

# island.agent.key_cleared_format
source: %@ key cleared
ja: %@ キーを消去しました
zh_hans: %@ 密钥已清除
zh_hant: %@ 金鑰已清除

# island.agent.clipboard_empty
source: Clipboard empty
ja: クリップボードが空です
zh_hans: 剪贴板为空
zh_hant: 剪貼簿為空

# island.agent.key_pasted
source: Key pasted
ja: キーを貼り付けました
zh_hans: 已粘贴密钥
zh_hant: 已貼上金鑰

# island.agent.reading_selection
source: Reading selection
ja: 選択範囲を読取中
zh_hans: 正在读取选区
zh_hant: 正在讀取選取範圍

# island.agent.translating
source: Translating
ja: 翻訳中
zh_hans: 正在翻译
zh_hant: 正在翻譯

# island.agent.capturing
source: Capturing
ja: 画面取得中
zh_hans: 正在截屏
zh_hant: 正在截圖

# island.agent.streaming
source: Streaming
ja: ストリーミング中
zh_hans: 流式输出中
zh_hant: 串流輸出中

# island.agent.no_output
source: No output
ja: 出力なし
zh_hans: 无输出
zh_hant: 無輸出

# island.agent.translated_format
source: Translated %.1fs
ja: 翻訳完了 %.1fs
zh_hans: 已翻译 %.1fs
zh_hant: 已翻譯 %.1fs

# island.agent.done_format
source: Done %.1fs
ja: 完了 %.1fs
zh_hans: 完成 %.1fs
zh_hant: 完成 %.1fs
